# April 14
##やったこと（タスクベース  科目・参考書（ページ数）・時間（））
・Ruby 5h
  ・リファレンス　手動かしながら　Integer測る
  ・リファレンス　手動かしながら　Integer測って1時間の量
  ->Numeric,integer,float
  ・paiza練習問題 1時間できる量測る
  ９問
  試験本　１ｈ（忘れていた）
    ・３章　文法
      ・for,case,while,until
・Rails 3.5h
  ・単機能アプリ やったことあるやつ1個、やったことないやつ1個
  ・Ruby on rails アプリケーションプログラミング　パラシュート的に


##難しかったこと、わからなかったこと
・進数
・数学用語がパッとわからないことがあった
  ・自然数、商、最大公約数、公倍数、除算、指数
  除算には割られる数を「被除数（ひじょすう）」、割る数を「除数（じょすう）」、商となる数を「商（しょう）」、割り切れない余りを「余り（あまり）」と呼びます。商を求める操作を「商算（しょうざん）」、余りを求める操作を「余り算（あまりざん）」と呼びます。
・数値クラスは子クラス定義が優先？

##分かったこと
Ruby
・置き換えの時はgsub以外にmap!などが使える、一つ一つ置き換えたい時はブロックに渡す　ブロックの要素一つ一つに渡して処理をする、判定する
・aa.map! do |num|
  num == a ? b : num
end
・参考urlの入れ替えかた、swap等メソッドを自分で定義すると後々いい
・例外処理の一例　begin rescue

## 課題
・復習が習慣化できていないので各単元終了30分前は復習の時間に充てる
・before_hogehogeの種類
・単アプしつつ見た目をいい感じにする練習

## memo
今日から復習、振り返りに役立てる為、書いていきます
長めの体調不良から回復しました
勉強はできなかったけど読書は進みました
前半時間たくさんあると思ってゆっくりしてしまうので改善したい
まだまだタスクベースで進められてないから改善していきたいです

37 [配列内をswapしよう。 - nekoTheShadow’s diary](https://nekotheshadow.hatenablog.com/entry/2015/01/24/182958)